#![feature(asm)]
#![allow(dead_code)]
#![no_std]
#![no_main]

mod arch;
mod console;

use core::panic::PanicInfo;

#[panic_handler]
fn panic(info: &PanicInfo) -> ! {
    println!("\nA kernel panic has occurred.");
    print!("{}", info);
    loop {}
}

static MESSAGE: &str =
r#"╔═══════════════════╗
║ Welcome to SEREX! ║
╚═══════════════════╝"#;

static KOJIKI: &str =
r#"序、古事記序

　臣安萬侶言：夫，混元既凝，氣象未效。無名無為，誰知其形。然乾坤初分，參神作造化之首。陰陽斯開，二靈為群品之祖。所以，出入幽顯，日月彰於洗目。浮沉海水，神祇呈於滌身。故太素杳冥，因本教而識孕土產島之時，元始綿邈，賴先聖而察生神立人之世。寔知，懸鏡吐珠，而百王相續。喫劍切蛇，以萬神蕃息與。議安河而平天下，論小濱而淸國土。

　是以，番仁岐命，初降于高千嶺。【○瓊瓊杵尊。】神倭天皇，經歷于秋津島。化熊出爪，天劍獲於高倉。生尾遮徑，大烏導於吉野。列儛攘賊，聞歌伏仇。【○神武。】即覺夢而敬神祇，所以稱賢后。【○崇神。】望烟而撫黎元，於今傳聖帝。【○仁德。】定境開邦，制于近淡海。【○成務。】正姓撰氏，勒于遠飛鳥。【○允恭。】雖步驟各異，文質不同。莫不稽古以繩風猷於既頽，照今以補典教於欲絕。

　曁飛鳥清原大宮御大八洲天皇御世，潛龍體元，洊雷應期。聞夢歌而相纂業，投夜水而知承基。然天時未臻，蟬蛻於南山，人事共洽，虎步於東國。皇輿忽駕，凌渡山川，六師雷震，三軍電逝。杖矛擧威，猛士烟起，絳旗耀兵，凶徒瓦解。未移浹辰，氣沴自清。乃放牛息馬，愷悌歸於華夏。卷旌戢戈，儛詠停於都邑。歳次大梁，月踵俠鍾，清原大宮，昇即天位。道軼軒后，德跨周王。握乾符而摠六合，得天統而包八荒。乘二氣之正，齊五行之序。設神理以奬俗，敷英風以弘國。重加，智海浩瀚，潭探上古。心鏡煒煌，明覩先代。

　於是，天皇詔之：「朕聞諸家之所齎帝紀及本辭，既違正實，多加虛偽。當今之時，不改其失，未經幾年，其旨欲滅。斯乃，邦家之經緯，王化之鴻基焉。故惟，撰錄帝紀，討覈舊辭，削偽定實，欲流後葉。」時有舍人，姓稗田名阿禮，年是廿八。為人聰明，度目誦口，拂耳勒心。即勅語阿禮，令誦習帝皇日繼，及先代舊辭。然運移世異，未行其事矣。

　伏惟皇帝陛下，得一光宅，通三亭育。御紫宸而德被馬蹄之所極，坐玄扈而化照船頭之所逮。日浮重暉，雲散非烟。連柯并穗之瑞，史不絕書。列烽重譯之貢，府無空月。可謂名高文命，德冠天乙矣。

　於焉，惜舊辭之誤忤，正先紀之謬錯。以和銅四年九月十八日，詔臣安萬侶：「撰錄稗田阿禮所誦之勅語舊辭，以獻上。」者。謹隨詔旨，子細採摭。然上古之時，言意並朴，敷文構句，於字即難。已因訓述者，詞不逮心。全以音連者，事趣更長。是以今，或一句之中，交用音訓。或一事之内，全以訓錄。即辭理叵見以注明，意況易解更非注。亦於姓日下謂くさか，於名帶字謂たらす，如此之類，隨本不改。
　大抵所記者，自天地開闢始，以訖于小治田御世。故天御中主神以下，日子波限建鵜草葺不合尊以前，為上卷。神倭伊波禮毘古天皇以下，品陀御世以前，為中卷。大雀皇帝以下，小治田大宮以前，為下卷。并錄三卷，謹以獻上。臣安萬侶，誠惶誠恐，頓首頓首。

和銅五年正月廿八日　正五位上勲五等　太朝臣安萬侶"#;

fn kmain(boot_information: multiboot2::BootInformation) -> ! {
    print!("{}", KOJIKI);
    loop{}
}